import re
# {}表示限定的位数，可与单字符组合使用
# {4} 表示限定四位
# {1,3}表示1到3位

# \d{1,2}表示1到2位数字
# \d{1,5}表示1到5位数字
# \d{11}表示可以匹配11位数字

# [1-57-9]{1,2}表示匹配1到5 7到9数字1-2位
r1 = re.match(r"\d{1,2}","3pyyjpd")
print(r1)

r2 = re.match(r"[1-57-9]{4}","3457dfsdd")
print(r2)

# case:匹配手机号，首位0371是固定的，-可写可不屑
# 尾号是8位数字
# ？表示它前面一位可有可无
# -？表示横杠可有可无
num = input("请输入电话号码")
r = re.match(r"0371-?\d{8}",num)
if r:
    print("匹配成功")
else:
    print("匹配失败")

# {}*+表示的都是限定位数
# {}里面
# * 表示至少有0个
# + 表示至少有1个表示字符的数字

# .* 表示匹配至少0个除\n以外的符号
# .+ 表示匹配至少1个除\n以外的符号
# [a-zA-Z_]+ 表示至少有1个大小写字母
# [a-zA-Z0-9_]* 表示至少有0位大小写字母和字数

# ^ 表示以谁开头
# $ 表示以谁结尾
# ^\d+ 表示以数字开头
# ^[a-zA-Z_] 表示以字母当作开头
# [a-zA-Z_]*$ 表示从前到后都必须是字母

r1 = re.match(r"[a-zA-Z_]+","python")
print("r1",r1)

r2 = re.match(r"[a-zA-Z_]*$","python333")
print("r2",r2)

r3 = re.match(r"^[a-zA-Z_]","python333")
print("r3",r3)

r4 = re.match(r"[a-zA-Z0-9_]*","0python333")
print("r4",r4)