# 增
'''
1、通过update()函数添加字典元素
2、通过add()函数添加
'''
print("--------------增--------------")
set1 = {"12","34","345","11"}
set1.update({"14","18"})
set1.add("9999")
print(set1)


#删
'''
1、通过pop()函数删除，删除最前面一个元素
2、通过remove()删除指定元素
'''
print("--------------删--------------")
set1 = {"12","34","345","11"}
set1.pop()#删除最前面一个
set1.remove("34")
print(set1)


#改
'''
1、使用update()向集合添加任意数据类型（除了Bool类型），
当为字典类型时，添加的是键，值会省略
'''
print("--------------改--------------")
set1 = {"12","34","345","11"}
set1.update((23,344))
set1.update([888,999])
set1.update({"a":23,"b":66})
print(set1)

#查
'''
1、in

'''
bools = "12" in set1
print(bools)




