#不可变数据类型：
'''
当该数据类型的对应变量的值发生了改变，
那么它对应的内存地址也会发生变化
'''

#可变数据类型：
'''
当该数据类型的对应变量的值发生了改变，
那么它对应的内存地址不发生改变
'''
#1、整型为不可变数据类型
print("------------整型不可变------------")
a = 1
print(id(a))
a = 12
print(id(a))

#2、字符串为不可变数据类型
print("------------字符串不可变------------")
a = "a"
print(id(a))
a = "d"
print(id(a))

#3、元组为不可变数据类型,相当于只读模式
print("------------元组不可变------------")

#4、列表为可变数据类型
print("------------列表可变------------")
a = [12,33,45,66]
print(id(a))
a.append(45)
print(id(a))


#5、字典为可变数据类型
print("------------字典可变------------")
a = {"a":12,"b":33,"c":45}
print(id(a))
a["d"] = 30
print(id(a))

#6、集合可变数据类型
print("------------集合可变------------")
a = {12,33,45,66}
print(id(a))
a.add(78)
print(id(a))






